In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.4.4
1.21.5

In [5]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df= pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                columns=cols)
df

    A   B   C   D   E
0  11   8   6   1  10
1   8  14  14  11  15
2  10  19   5   4   9
3   3  18  18   9  15
4  12  11  18  19   3

In [15]:
df.query('A > 10')

    A   B   C   D   E
0  11   8   6   1  10
4  12  11  18  19   3

In [16]:
retata = df['A'].mean()
retata

8.8

In [14]:
df.query('A > @retata')

    A   B   C   D   E
0  11   8   6   1  10
2  10  19   5   4   9
4  12  11  18  19   3